src/test/resources/betamax/tapes/create_a_subscription.yaml

!tape
name: create a subscription
interactions:
- recorded: 2015-04-20T13:20:43.543Z
  request:
    method: POST
    uri: https://api-sandbox.gocardless.com/subscriptions
    headers:
      Accept-Encoding: gzip
      Connection: Keep-Alive
      Content-Length: '113'
      Content-Type: application/json; charset=utf-8
      GoCardless-Version: '2014-11-03'
      Host: api-sandbox.gocardless.com
      User-Agent: gocardless-pro/0.0.1 Mac_OS_X/10.10.2 Java_HotSpot(TM)_64-Bit_Server_VM/1.8.0_40
    body: '{"subscriptions":{"amount":1000,"currency":"GBP","interval_unit":"monthly","links":{"mandate":"MD00001PEYCSQF"}}}'
  response:
    status: 201
    headers:
      Cache-Control: no-store
      Content-Type: application/json; charset=utf-8
      Date: Mon, 20 Apr 2015 13:20:43 GMT
      ETag: W/"30108b14643892fd0459b0804e59c43b"
      Location: https://api-sandbox.gocardless.com/subscriptions/SB000011EYZVP7
      Pragma: no-cache
      RateLimit-Limit: '2000'
      RateLimit-Remaining: '1999'
      RateLimit-Reset: Mon, 20 Apr 2015 13:21:00 GMT
      Server: nginx
      Status: 201 Created
      Strict-Transport-Security: max-age=31556926; includeSubDomains
      Vary: Origin
      X-Content-Type-Options: nosniff
      X-Frame-Options: SAMEORIGIN
      X-Request-Id: 1eb3efff-a97d-4c39-be58-2875fe6626de
      X-XSS-Protection: 1; mode=block
    body: '{"subscriptions":{"id":"SB000011EYZVP7","created_at":"2015-04-20T13:20:43.273Z","amount":1000,"currency":"GBP","status":"active","name":null,"start_at":"2015-04-23","end_at":null,"interval":1,"interval_unit":"monthly","day_of_month":null,"month":null,"metadata":{},"upcoming_payments":[{"charge_date":"2015-04-23","amount":1000},{"charge_date":"2015-05-26","amount":1000},{"charge_date":"2015-06-23","amount":1000},{"charge_date":"2015-07-23","amount":1000},{"charge_date":"2015-08-24","amount":1000},{"charge_date":"2015-09-23","amount":1000},{"charge_date":"2015-10-23","amount":1000},{"charge_date":"2015-11-23","amount":1000},{"charge_date":"2015-12-23","amount":1000},{"charge_date":"2016-01-25","amount":1000}],"links":{"mandate":"MD00001PEYCSQF"}}}'
